Revit 2027 API
Element.IsMonitoringLocalElement Method
 Indicate whether an element is monitoring other local elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMonitoringLocalElement()
Public Function IsMonitoringLocalElement As Boolean
public:
bool IsMonitoringLocalElement()
member IsMonitoringLocalElement : unit -> bool
Return Value
Boolean
 True if this element is monitoring other elements in same project. Otherwise, false will be returned.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace